---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Railing.RemoveHost
zh: 栏杆
source: html/28367859-53d5-fbbe-2d55-16970e62e9b4.htm
---
# Autodesk.Revit.DB.Architecture.Railing.RemoveHost Method

**中文**: 栏杆

Removes the association between the railing and its host.

## Syntax (C#)
```csharp
public void RemoveHost()
```